src/ChartsOfCharacteristicTypes/ПоказателиОбъектов/ПоказателиОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:ChartOfCharacteristicTypes>
  <name>ПоказателиОбъектов</name>
  <type>
    <types>Boolean</types>
    <types>String</types>
    <types>Date</types>
    <types>Number</types>
    <numberQualifiers>
      <precision>10</precision>
    </numberQualifiers>
    <stringQualifiers>
      <length>250</length>
    </stringQualifiers>
    <dateQualifiers>
      <dateFractions>Date</dateFractions>
    </dateQualifiers>
  </type>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>СпособРасчета</name>
    <type>
      <types>EnumRef.СпособыРасчетаПоказателейОбъектов</types>
    </type>
  </attributes>
  <attributes>
    <name>Индексируемый</name>
    <comment>не реализовано</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Периодичность</name>
    <type>
      <types>EnumRef.ПериодичностьПоказателяОбъекта</types>
    </type>
  </attributes>
  <attributes>
    <name>ТекстЗапроса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВыполняемыйКод</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьРегламентноеЗаданиеГруппыПоказателей</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Отбор</name>
    <comment>не реализовано</comment>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьРасчетПоРегламетномуЗаданию</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламетногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗапускатьРасчетПоТриггерам</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИдентификаторРегламентногоЗадания</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Параметры</name>
    <comment>Параметры запроса или выполняемого кода</comment>
    <attributes>
      <name>ИмяПараметра</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗначениеПараметра</name>
      <type>
        <types>Boolean</types>
        <types>String</types>
        <types>Date</types>
        <types>Number</types>
        <types>AnyRef</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Триггеры</name>
    <attributes>
      <name>ОбъектМетаданных</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданныхПО</types>
      </type>
    </attributes>
    <attributes>
      <name>Ключ</name>
      <type>
        <types>CatalogRef.СвойстваОбъектовМетаданныхПО</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтложенныйРасчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Владельцы</name>
    <attributes>
      <name>Владелец</name>
      <type>
        <types>CatalogRef.ОбъектыМетаданныхПО</types>
      </type>
    </attributes>
    <attributes>
      <name>ВладелецПолноеИмя</name>
      <comment>Нужен для характеристик объектов (в качестве поля отбора)</comment>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:ChartOfCharacteristicTypes>

src/Enums/СпособыРасчетаПоказателейОбъектов/СпособыРасчетаПоказателейОбъектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>СпособыРасчетаПоказателейОбъектов</name>
  <enumValues>
    <name>ВыполнитьКод</name>
  </enumValues>
  <enumValues>
    <name>Запрос</name>
  </enumValues>
</mdclass:Enum>

src/ChartsOfCharacteristicTypes/ПоказателиОбъектов/ObjectModule.bsl
#Область ОбраработчикиСобытий

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	ПроверитьКорректностьИдентификатора(Отказ);
	
	НеПроверяемыеРеквизиты = Новый Массив;
	
	Если (СпособРасчета <> Перечисления.СпособыРасчетаПоказателейОбъектов.ВыполнитьКод) Тогда
		НеПроверяемыеРеквизиты.Добавить("ВыполняемыйКод");		
	КонецЕсли;
	
	Если (СпособРасчета <> Перечисления.СпособыРасчетаПоказателейОбъектов.Запрос) Тогда
		НеПроверяемыеРеквизиты.Добавить("ТекстЗапроса");
	КонецЕсли;
	
	Для Каждого ИмяРеквизита Из НеПроверяемыеРеквизиты Цикл
		Индекс = ПроверяемыеРеквизиты.Найти(ИмяРеквизита);
		Если (Индекс <> Неопределено) Тогда
			ПроверяемыеРеквизиты.Удалить(Индекс);
		КонецЕсли;
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередУдалением(Отказ)
	
	РегламентноеЗадание_ПередУдалением();
	
КонецПроцедуры

Процедура ПриКопировании(ОбъектКопирования)
	
	ЗапускатьРасчетПоРегламетномуЗаданию = Ложь;
	ИдентификаторРегламентногоЗадания = Неопределено;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если (ОбменДанными.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЭтоНовый() Тогда
		НоваяСсылка = ПланыВидовХарактеристик.ПоказателиОбъектов.ПолучитьСсылку(Новый УникальныйИдентификатор());
		УстановитьСсылкуНового(НоваяСсылка);
	КонецЕсли;
	
	Владельцы_ПередЗаписью();
	
	РегламентноеЗадание_ПередЗаписью();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если (ОбменДанными.Загрузка) Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьПовторноИспользуемыеЗначения();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

#Область РегламентноеЗадание

Процедура РегламентноеЗадание_ПередЗаписью()
		
	// Регламентное задание
	Если ЗапускатьРасчетПоРегламетномуЗаданию
		И Не ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
		
		Задание = СоздатьРегламентноеЗадание();
		ИдентификаторРегламентногоЗадания = Задание.УникальныйИдентификатор;
		
	ИначеЕсли Не ЗапускатьРасчетПоРегламетномуЗаданию И ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
		 
		 УдалитьРегламентноеЗадание();
		 ИдентификаторРегламентногоЗадания = Неопределено;
			
	КонецЕсли;
	
	Расписание = Неопределено;
	Если ЗапускатьРасчетПоРегламетномуЗаданию И ДополнительныеСвойства.Свойство("Расписание", Расписание) Тогда
		УстановитьРасписаниеРегламентногоЗадания(Расписание);
	КонецЕсли;
	
КонецПроцедуры

Процедура РегламентноеЗадание_ПередУдалением()
	
	Если ЗначениеЗаполнено(ИдентификаторРегламентногоЗадания) Тогда
		УдалитьРегламентноеЗадание();
	КонецЕсли;
	
КонецПроцедуры

// Создает регламентное задание
// 
// Параметры:
// 	Показатель - ПланВидовХарактеристикСсылка.ПоказателиОбъектов - Показатель
// Возвращаемое значение: РегламентноеЗадание - Регламентное задание.
// 	
Функция СоздатьРегламентноеЗадание()
	
	СсылкаНаПоказатель = ?(ЭтоНовый(), ПолучитьСсылкуНового(), Ссылка);
	
	НовоеЗадание = РегламентныеЗадания.СоздатьРегламентноеЗадание(
			Метаданные.РегламентныеЗадания.РегламентныйРасчетПоказателя);
			
	НовоеЗадание.Наименование = СтрШаблон(НСтр("ru = 'Расчет показателя ""%1"".'"), Наименование);
	НовоеЗадание.Параметры.Добавить(СсылкаНаПоказатель);
	НовоеЗадание.Ключ = Строка(СсылкаНаПоказатель.УникальныйИдентификатор());
	НовоеЗадание.Использование = Истина;
	НовоеЗадание.Записать();
	
	Возврат НовоеЗадание;
	
КонецФункции

Процедура УстановитьРасписаниеРегламентногоЗадания(Расписание)
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
	Если Задание <> Неопределено Тогда
		Задание.Расписание = Расписание;
		Задание.Записать();
	КонецЕсли;
	
КонецПроцедуры

Процедура УдалитьРегламентноеЗадание()
	
	Задание = РегламентныеЗадания.НайтиПоУникальномуИдентификатору(ИдентификаторРегламентногоЗадания);
	Если Задание <> Неопределено Тогда
		Задание.Удалить();
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область Владельцы

Процедура Владельцы_ПередЗаписью()
	
	// #РеквизитыОбъектов
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("Владельцы", Владельцы.ВыгрузитьКолонку("Владелец"));
	
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ОбъектыМетаданныхПО.Ссылка КАК Ссылка,
		|	ОбъектыМетаданныхПО.ПолноеИмя КАК ПолноеИмя
		|ИЗ
		|	Справочник.ОбъектыМетаданныхПО КАК ОбъектыМетаданныхПО
		|ГДЕ
		|	ОбъектыМетаданныхПО.Ссылка В (&Владельцы)";
		
	Выборка = Запрос.Выполнить().Выбрать();
	
	Для Каждого СтрокаВладельца Из Владельцы Цикл
		
		Выборка.Сбросить();
		Если (Выборка.НайтиСледующий(Новый Структура("Ссылка", СтрокаВладельца.Владелец))) Тогда
			СтрокаВладельца.ВладелецПолноеИмя = Выборка.ПолноеИмя;
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

Процедура ПроверитьКорректностьИдентификатора(Отказ)
	
	Попытка
		//@skip-warning
		Структура = Новый Структура(Код);
	Исключение
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = НСтр("ru = 'Некорректный идентификатор показателя'");
		Сообщение.Поле = "Код";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
	КонецПопытки;
	
КонецПроцедуры

#КонецОбласти
